[
    {
        "client_msg_id": "1654ff32-7fa0-42d0-8b69-942c8ede6a82",
        "type": "message",
        "text": "<https:\/\/workday.wd5.myworkdayjobs.com\/Workday\/job\/USA-CO-Boulder\/Product-Strategy-Intern_JR-81961-1>",
        "user": "U05AFDTJEUW",
        "ts": "1698677839.734509",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "2on7x",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "link",
                                "url": "https:\/\/workday.wd5.myworkdayjobs.com\/Workday\/job\/USA-CO-Boulder\/Product-Strategy-Intern_JR-81961-1"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "72b4e8495ef2",
            "image_72": "https:\/\/avatars.slack-edge.com\/2023-09-18\/5924924451553_72b4e8495ef27fb8d9ff_72.jpg",
            "first_name": "Alex",
            "real_name": "Alex Chamberlain",
            "display_name": "",
            "team": "T0ZBAEL59",
            "name": "alexander.chamberlain",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "from_url": "https:\/\/workday.wd5.myworkdayjobs.com\/Workday\/job\/USA-CO-Boulder\/Product-Strategy-Intern_JR-81961-1",
                "image_url": "https:\/\/workday.wd5.myworkdayjobs.com\/Workday\/assets\/logo",
                "image_width": 1200,
                "image_height": 630,
                "image_bytes": 76513,
                "service_icon": "https:\/\/workday.wd5.myworkdayjobs.com\/favicon.ico",
                "id": 1,
                "original_url": "https:\/\/workday.wd5.myworkdayjobs.com\/Workday\/job\/USA-CO-Boulder\/Product-Strategy-Intern_JR-81961-1",
                "fallback": "MBA Product Strategy Intern",
                "text": "Your work days are brighter here. At Workday, it all began with a conversation over breakfast. When our founders met at a sunny California diner, they came up with an idea to revolutionize the enterprise software market. And when we began to rise, one thing that really set us apart was our culture. A culture which was driven by our value of putting our people first. And ever since, the happiness, development, and contribution of every Workmate is central to who we are. Our Workmates believe a healthy employee-centric, collaborative culture is the essential mix of ingredients for success in business. That’s why we look after our people, communities and the planet while still being profitable. Feel encouraged to shine, however that manifests: you don’t need to hide who you are. You can feel the energy and the passion, it's what makes us unique. Inspired to make a brighter work day for all and transform with us to the next stage of our growth journey? Bring your brightest version of you and have a brighter work day here. About the Team The Office of the CHRO Product Strategy team oversees the product strategy, roadmap and lifecycle of the company’s product portfolio for HCM Products. Our team defines and drives the business plan, short- and long-term growth strategy and positioning of Workday's products in the market. We direct the end-to-end leadership of new and existing products from inception through all phases of the product life cycle. About the Role As an MBA Intern, you will have the opportunity to work hand in hand with Product Specialists to articulate the vision and strategy for key product areas, as well as help build the sequence of steps and actions that will be required to achieve that vision. You will build the story around strategic recommendations and help to assemble presentations for our senior and executive leaders. You will also build and analyze financial models for data-driven strategy recommendations while working with Business Finance and other teams. About You Basic Qualifications: Currently pursuing an MBA degree, with a grad date of no earlier than Dec 2024 Pursuing a major in Business, Marketing, Finance, or an equivalent field Able to commit to a full-time internship program for 12 weeks during the summer of 2024. You will return to university studies after the conclusion of the internship. Other Qualifications: Experience or coursework related to Human Resources, Product Development or Product Strategy, financial analyst, data analyst, market research You are a critical thinker with an analytical approach. A highly motivated, quick learner, who thrives on creatively and solving tough problems. Good verbal and written communication skills with the ability to easily and intuitively adapt content to various types of audiences. Propensity to be curious and explore new ideas and information Listens actively to understand others’ points of view Workday Internship Program Ready for your career to shine? At Workday, we believe that the next generation of talent is essential to our success, which is why we seek hard-working students with open minds, new perspectives, and bright ideas to join our Intern &amp; Co-Op Program. During either the 12-week internship or multi-month co-op experience, you’ll make an impact at Workday by engaging in meaningful work, all the while forging professional connections, and strengthening your skills in an encouraging environment. Plus, you’ll be encouraged to bring your brightest self to work with coaching and mentorship, connection events and exposure to Workday’s stellar culture while living our Core Values. Let’s make workdays brighter. Apply today to start your career as a member of the Workday Intern &amp; Co-Op Program! Workday is proud of its diverse workforce but does not sponsor employment visas or consider individuals on time-limited visas that will require sponsorship now or in the future for these positions. Workday Pay Transparency Statement - United States The annualized base salary ranges for the primary location and any additional locations in the United States (US) are listed below. Workday pay ranges vary based on work location. As a part of the total compensation package, this role may be eligible for the Workday Bonus Plan or a role-specific commission\/bonus, as well as annual refresh stock grants. Recruiters can share more detail during the hiring process. Each candidate’s compensation offer will be based on multiple factors including, but not limited to, geography, experience, skills, job duties, and business need, among other things. For more information regarding Workday’s comprehensive benefits, please click here. Primary Location: USA.CO.Boulder Primary Location Base Pay Range: $49,900 - $115,000 Additional US Location(s) Base Pay Range: $47,400 - $115,000 Our Approach to Flexible Work With Flex Work, we’re combining the best of both worlds: in-person time and remote. Our approach enables our teams to deepen connections, maintain a strong community, and do their best work. We know that flexibility can take shape in many ways, so rather than a number of required days in-office each week, we simply spend at least half (50%) of our time each quarter in the office or in the field with our customers, prospects, and partners (depending on role). This means you'll have the freedom to create a flexible schedule that caters to your business, team, and personal needs, while being intentional to make the most of time spent together. Those in our remote \"home office\" roles also have the opportunity to come together in our offices for important moments that matter. Pursuant to applicable Fair Chance law, Workday will consider for employment qualified applicants with arrest and conviction records. Workday is an Equal Opportunity Employer including individuals with disabilities and protected veterans. Are you being referred to one of our roles? If so, ask your connection at Workday about our Employee Referral process! Join our talent community and receive the latest Workday news, content, and be first in line for new job opportunities. Join our Talent Community! Please visit this benefits site! Please visit the Contractor Positions at Workday page With Flex Work, we’re combining the best of both worlds: in-person time and remote. Our approach enables our teams to deepen connections, maintain a strong community, and do their best work. We know that flexibility can take shape in many ways, so rather than a number of required days in-office each week, we simply spend at least half (50%) of our time each quarter in the office or in the field with our customers, prospects, and partners (depending on role). This means you'll have the freedom to create a flexible schedule that caters to your business, team, and personal needs, while being intentional to make the most of time spent together. Those in our remote \"home office\" roles also have the opportunity to come together in our offices for important moments that matter. At Workday, our employees have always been our number one Core Value. We understand that everyone has unique experiences and perspectives which is why our mission is to create a safe space where all people and ideas are welcomed. Our commitment to value inclusion, belonging, and equity (VIBE™) and creating a brighter workday for all is the cornerstone of all we do. Join us! Workday is a leading provider of enterprise cloud applications for finance and human resources. Founded in 2005, Workday delivers financial management, human capital management, and analytics applications designed for the world's largest companies, educational institutions, and government agencies. Organizations ranging from medium-sized businesses to Fortune 50 enterprises have selected Workday. Workday is proud to be an equal opportunity workplace. Individuals seeking employment at Workday are considered without regards to age, ancestry, color, gender (including pregnancy, childbirth, or related medical …",
                "title": "MBA Product Strategy Intern",
                "title_link": "https:\/\/workday.wd5.myworkdayjobs.com\/Workday\/job\/USA-CO-Boulder\/Product-Strategy-Intern_JR-81961-1",
                "service_name": "workday.wd5.myworkdayjobs.com"
            }
        ],
        "thread_ts": "1698677839.734509",
        "reply_count": 1,
        "reply_users_count": 1,
        "latest_reply": "1698689732.511639",
        "reply_users": [
            "U03LK5045V0"
        ],
        "replies": [
            {
                "user": "U03LK5045V0",
                "ts": "1698689732.511639"
            }
        ],
        "is_locked": false,
        "subscribed": false
    },
    {
        "client_msg_id": "035d371d-7d19-4be9-a255-9f5edd742644",
        "type": "message",
        "text": "Workday using Workday to post a job at Workday... now that's meta...",
        "user": "U03LK5045V0",
        "ts": "1698689732.511639",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "4PtpG",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Workday using Workday to post a job at Workday... now that's meta..."
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "b0a4fbd21f41",
            "image_72": "https:\/\/avatars.slack-edge.com\/2022-06-25\/3705740993831_b0a4fbd21f41527354e8_72.jpg",
            "first_name": "Cristian",
            "real_name": "Cristian Torres",
            "display_name": "Cristian Torres",
            "team": "T0ZBAEL59",
            "name": "cntorres",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1698677839.734509",
        "parent_user_id": "U05AFDTJEUW",
        "reactions": [
            {
                "name": "businessparrot",
                "users": [
                    "U03LCGQP0LW"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "619eddb2-994e-4fd3-b58c-ded3ff15b277",
        "type": "message",
        "text": "Does any of you know of anybody that loves HR + Data Analysis? Ben Hatch (BYU MBA Alumni 2016) posted this for a role on LinkedIn. This role is in Ben's team, so it would be great to connect with him to know more about it.\n\n<https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&trackingId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&lipi=urn%3Ali%3Apage%3Ad_flagship3_feed%3BWyzM5cwMQNKBIgtcoJ9WUA%3D%3D&lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D|https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&tra[…]zM5cwMQNKBIgtcoJ9WUA%3D%3D&lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D>",
        "user": "U03LMGXDFB6",
        "ts": "1698698593.477349",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "7ZHpg",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Does any of you know of anybody that loves HR + Data Analysis? Ben Hatch (BYU MBA Alumni 2016) posted this for a role on LinkedIn. This role is in Ben's team, so it would be great to connect with him to know more about it.\n\n"
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&trackingId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&lipi=urn%3Ali%3Apage%3Ad_flagship3_feed%3BWyzM5cwMQNKBIgtcoJ9WUA%3D%3D&lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D",
                                "text": "https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&tra[…]zM5cwMQNKBIgtcoJ9WUA%3D%3D&lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "a69a8ef070ef",
            "image_72": "https:\/\/avatars.slack-edge.com\/2023-03-25\/5002998094422_a69a8ef070ef27af0ae4_72.png",
            "first_name": "Fabian",
            "real_name": "Fabian Serradell",
            "display_name": "",
            "team": "T0ZBAEL59",
            "name": "fserrade",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "U03LMGXDFB6",
            "ts": "1698698607.000000"
        },
        "attachments": [
            {
                "from_url": "https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&trackingId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&lipi=urn%3Ali%3Apage%3Ad_flagship3_feed%3BWyzM5cwMQNKBIgtcoJ9WUA%3D%3D&lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D",
                "service_icon": "https:\/\/static.licdn.com\/aero-v1\/sc\/h\/al2o9zrvru7aqj8e1x2rzsrca",
                "id": 1,
                "original_url": "https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&amp;trackingId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&amp;lipi=urn%3Ali%3Apage%3Ad_flagship3_feed%3BWyzM5cwMQNKBIgtcoJ9WUA%3D%3D&amp;lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D",
                "fallback": "LinkedIn hiring Manager, HR Operations - Reporting in Sunnyvale, California, United States | LinkedIn",
                "text": "Posted 9:02:23 PM. Company DescriptionLinkedIn is the world’s largest professional network, built to create economic…See this and similar jobs on LinkedIn.",
                "title": "LinkedIn hiring Manager, HR Operations - Reporting in Sunnyvale, California, United States | LinkedIn",
                "title_link": "https:\/\/www.linkedin.com\/jobs\/view\/3748990012\/?refId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&trackingId=STKbbrGGdT4xNygVTTlHOQ%3D%3D&lipi=urn%3Ali%3Apage%3Ad_flagship3_feed%3BWyzM5cwMQNKBIgtcoJ9WUA%3D%3D&lici=STKbbrGGdT4xNygVTTlHOQ%3D%3D",
                "service_name": "linkedin.com"
            }
        ],
        "reactions": [
            {
                "name": "fire",
                "users": [
                    "U03LK39PKRR",
                    "U03TVL5QZFA"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "faf55407-bfea-4e82-a810-93b322604fd1",
        "type": "message",
        "text": "What up team!! Time for another networking\/recruiting event summary for the next week (or so):\n\n:bulb:*Info Sessions*\n• Pelion VP – 11\/6, 5:00PM - 6:00 PM in TNRB W210\n    ◦ Pelion is a Venture Capital firm, but the info session is not track specific, focused on internships\n    ◦ Register in Handshake here: <https:\/\/byu.joinhandshake.com\/stu\/events\/1333983>\n:knife_fork_plate: *Luncheon (Come &amp; Go)*\n• Dell – 11\/8, 12:00 PM - 1:30 PM in TNRB W459*\n    ◦ Focused on Marketing internships\n    ◦ Register in Handshake here: <https:\/\/byu.joinhandshake.com\/stu\/events\/1317537>\n    ◦ *Keep in mind that this event may conflict with Tech Trek trips. Confirm that you'll be able to attend before registering!\n:exclamation:Lastly, don't forget to check out these other opportunities (not in Handshake) happening soon as well:\n\n• 11\/1, 6:00 PM - 7:15 PM: <https:\/\/byumba.slack.com\/archives\/C0ZCSJTC5\/p1698698880002289|Marriott School Female Faculty Panel (WIM)>\nIf you have questions or know of any networking\/recruiting events missed here, please drop them in the thread below! :point_down:",
        "user": "U05AFDTJEUW",
        "ts": "1698713836.617639",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "\/C9xT",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "What up team!! Time for another networking\/recruiting event summary for the next week (or so):\n\n"
                            },
                            {
                                "type": "emoji",
                                "name": "bulb",
                                "unicode": "1f4a1",
                                "style": {
                                    "bold": true
                                }
                            },
                            {
                                "type": "text",
                                "text": "Info Sessions",
                                "style": {
                                    "bold": true
                                }
                            },
                            {
                                "type": "text",
                                "text": "\n"
                            }
                        ]
                    },
                    {
                        "type": "rich_text_list",
                        "elements": [
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "Pelion VP – 11\/6, 5:00PM - 6:00 PM in TNRB W210"
                                    }
                                ]
                            }
                        ],
                        "style": "bullet",
                        "indent": 0,
                        "border": 0
                    },
                    {
                        "type": "rich_text_list",
                        "elements": [
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "Pelion is a Venture Capital firm, but the info session is not track specific, focused on internships"
                                    }
                                ]
                            },
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "Register in Handshake here: "
                                    },
                                    {
                                        "type": "link",
                                        "url": "https:\/\/byu.joinhandshake.com\/stu\/events\/1333983"
                                    }
                                ]
                            }
                        ],
                        "style": "bullet",
                        "indent": 1,
                        "border": 0
                    },
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "\n"
                            },
                            {
                                "type": "emoji",
                                "name": "knife_fork_plate",
                                "unicode": "1f37d-fe0f"
                            },
                            {
                                "type": "text",
                                "text": " "
                            },
                            {
                                "type": "text",
                                "text": "Luncheon (Come & Go)",
                                "style": {
                                    "bold": true
                                }
                            },
                            {
                                "type": "text",
                                "text": "\n"
                            }
                        ]
                    },
                    {
                        "type": "rich_text_list",
                        "elements": [
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "Dell – 11\/8, 12:00 PM - 1:30 PM in TNRB W459*"
                                    }
                                ]
                            }
                        ],
                        "style": "bullet",
                        "indent": 0,
                        "border": 0
                    },
                    {
                        "type": "rich_text_list",
                        "elements": [
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "Focused on Marketing internships"
                                    }
                                ]
                            },
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "Register in Handshake here: "
                                    },
                                    {
                                        "type": "link",
                                        "url": "https:\/\/byu.joinhandshake.com\/stu\/events\/1317537"
                                    }
                                ]
                            },
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "*Keep in mind that this event may conflict with Tech Trek trips. Confirm that you'll be able to attend before registering!"
                                    }
                                ]
                            }
                        ],
                        "style": "bullet",
                        "indent": 1,
                        "border": 0
                    },
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "\n"
                            },
                            {
                                "type": "emoji",
                                "name": "exclamation",
                                "unicode": "2757"
                            },
                            {
                                "type": "text",
                                "text": "Lastly, don't forget to check out these other opportunities (not in Handshake) happening soon as well:\n\n"
                            }
                        ]
                    },
                    {
                        "type": "rich_text_list",
                        "elements": [
                            {
                                "type": "rich_text_section",
                                "elements": [
                                    {
                                        "type": "text",
                                        "text": "11\/1, 6:00 PM - 7:15 PM: "
                                    },
                                    {
                                        "type": "link",
                                        "url": "https:\/\/byumba.slack.com\/archives\/C0ZCSJTC5\/p1698698880002289",
                                        "text": "Marriott School Female Faculty Panel (WIM)"
                                    }
                                ]
                            }
                        ],
                        "style": "bullet",
                        "indent": 0,
                        "border": 0
                    },
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "\nIf you have questions or know of any networking\/recruiting events missed here, please drop them in the thread below! "
                            },
                            {
                                "type": "emoji",
                                "name": "point_down",
                                "unicode": "1f447"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "72b4e8495ef2",
            "image_72": "https:\/\/avatars.slack-edge.com\/2023-09-18\/5924924451553_72b4e8495ef27fb8d9ff_72.jpg",
            "first_name": "Alex",
            "real_name": "Alex Chamberlain",
            "display_name": "",
            "team": "T0ZBAEL59",
            "name": "alexander.chamberlain",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "reactions": [
            {
                "name": "hearts",
                "users": [
                    "U03LK4YF3A6",
                    "U05H6DGRMRQ",
                    "U05A7HD4XE3",
                    "U03LXQBTQJV",
                    "U05AFDSJH70"
                ],
                "count": 5
            },
            {
                "name": "meow_party",
                "users": [
                    "U03LK4YF3A6"
                ],
                "count": 1
            }
        ]
    }
]