[
    {
        "client_msg_id": "6109c983-0cd5-446a-8ed5-3d04bff56399",
        "type": "message",
        "text": "Nationwide Rotational Program Full Time\n<https:\/\/jobs.nbmbaa.org\/job\/marketing-leadership-rotation-program-associate-columbus-848467\/?utm_medium=jbemail&amp;utm_source=job_agent&amp;utm_keyword=>",
        "user": "U03LK4YF3A6",
        "ts": "1698281705.920919",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "vttUC",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Nationwide Rotational Program Full Time\n"
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/jobs.nbmbaa.org\/job\/marketing-leadership-rotation-program-associate-columbus-848467\/?utm_medium=jbemail&utm_source=job_agent&utm_keyword="
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "3686677ded82",
            "image_72": "https:\/\/avatars.slack-edge.com\/2023-08-29\/5820926152499_3686677ded820a9e4cbe_72.png",
            "first_name": "Kelsee",
            "real_name": "Kelsee Gates",
            "display_name": "Kelsee Gates",
            "team": "T0ZBAEL59",
            "name": "kelsee690000",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "from_url": "https:\/\/jobs.nbmbaa.org\/job\/marketing-leadership-rotation-program-associate-columbus-848467\/?utm_medium=jbemail&utm_source=job_agent&utm_keyword=",
                "thumb_url": "https:\/\/wjm.s3.amazonaws.com\/nbmbaa\/uploads\/%26no_logo..jpg",
                "thumb_width": 113,
                "thumb_height": 100,
                "service_icon": "https:\/\/jobs.nbmbaa.org\/themes\/nbmbaa\/images\/favicon.png?1647018539",
                "id": 1,
                "original_url": "https:\/\/jobs.nbmbaa.org\/job\/marketing-leadership-rotation-program-associate-columbus-848467\/?utm_medium=jbemail&amp;utm_source=job_agent&amp;utm_keyword=",
                "fallback": "National Black MBA Association (NBMBAA): Marketing Leadership Rotation Program - Associate",
                "text": "If you’re passionate about becoming a Nationwide associate and believe you have the potential to be something great, let’s talk.Job Description SummaryAre you driven to lead, improve your management s...",
                "title": "Marketing Leadership Rotation Program - Associate",
                "title_link": "https:\/\/jobs.nbmbaa.org\/job\/marketing-leadership-rotation-program-associate-columbus-848467\/?utm_medium=jbemail&utm_source=job_agent&utm_keyword=",
                "service_name": "National Black MBA Association (NBMBAA)"
            }
        ]
    },
    {
        "client_msg_id": "7c4e1c34-5322-4187-ac88-52b3eadd762d",
        "type": "message",
        "text": "<https:\/\/pattern.wd1.myworkdayjobs.com\/en-US\/Pattern_Careers\/job\/Lehi-UT\/Internship---Product-Marketing_R-100508?source=Linkedin>",
        "user": "U03LXQE14NM",
        "ts": "1698281775.000549",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "Ut+Yr",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "link",
                                "url": "https:\/\/pattern.wd1.myworkdayjobs.com\/en-US\/Pattern_Careers\/job\/Lehi-UT\/Internship---Product-Marketing_R-100508?source=Linkedin"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "cc176dbcf62e",
            "image_72": "https:\/\/avatars.slack-edge.com\/2022-06-23\/3726381961473_cc176dbcf62ebe91e48a_72.jpg",
            "first_name": "Austin",
            "real_name": "Austin Schofield",
            "display_name": "Austin Schofield",
            "team": "T0ZBAEL59",
            "name": "schofieldda",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "image_url": "https:\/\/pattern.wd1.myworkdayjobs.com\/en-US\/Pattern_Careers\/assets\/logo",
                "image_width": 1407,
                "image_height": 284,
                "image_bytes": 14750,
                "from_url": "https:\/\/pattern.wd1.myworkdayjobs.com\/en-US\/Pattern_Careers\/job\/Lehi-UT\/Internship---Product-Marketing_R-100508?source=Linkedin",
                "service_icon": "https:\/\/pattern.wd1.myworkdayjobs.com\/favicon.ico",
                "id": 1,
                "original_url": "https:\/\/pattern.wd1.myworkdayjobs.com\/en-US\/Pattern_Careers\/job\/Lehi-UT\/Internship---Product-Marketing_R-100508?source=Linkedin",
                "fallback": "Internship - Product Marketing",
                "text": "Job Description: Are you obsessed with data, partner success, taking action, and changing the game? If you have a whole lot of hustle and a touch of nerd, come intern with Pattern to learn, grow, and use your skills to push one of the fastest-growing companies in the US to the top of the list! Pattern is the premier partner for global ecommerce acceleration and is headquartered in the United States, Utah's Silicon Slopes tech hub—with offices in Asia, Australia, Europe, the Middle East, and North America. Valued at $2 billion, Pattern has been named one of the fastest growing tech companies in North America by Deloitte and one of best-led companies in America by Inc. More than 150 global brands like Nestle, Sylvania, Kong, Panasonic, Sorel, and Pandora rely—rely on Pattern's global ecommerce acceleration platform to scale their business around the world. We place employee experience at the center of our business model and have been recognized as one of America's Most Loved Workplaces®. We are looking for a Product Marketing Intern on the marketing team to help us continuously improve our multimedia, omni-channel content creation, distribution, and optimization. This role will collaborate cross-functionally to facilitate world-class B2B marketing projects, such as videos, podcasts, social campaigns, etc…, and contribute to key content strategies. This is a part time role that works a hybrid schedule based in Lehi, Utah. Frequently Asked Questions What is a day in the life of a Product Marketing Intern? The Product Marketing Intern will support the Product Marketing team by performing analyses of go-to-market performance and business opportunities in the market This person also conducts research on competitor behavior and build buyer insights to understand buyer personas Compile analysis and financial models on customer trends and historical data to support decision-making Lead the development and execution of ad-hoc analysis to support data-driven pricing initiatives Conduct periodic analysis on the performance of existing products (e.g. pricing, adoption trend, usage, etc.) Quantify and estimate market sizes, identify key players and market trends Design new creative analytics and visualizations to help senior management get deeper insights into performance of key areas Perform in-depth analysis of go-to-market performance (win \/ loss analysis, etc) to identify areas for improvement Support the development and curation of marketing collateral by conducting research What will I need to thrive in this role? Must be a junior or senior in college enrolled in a degree in Marketing, Business, or related field Superior interpersonal, verbal, and written communication skills. Teachable and fast learner Self-motivated and proactive High ethical standards Experience in ecommerce or digital-first brands or marketplace commercial efforts (D2C, Amazon, <http:\/\/Walmart.com|Walmart.com>, etc.) is a plus What does high performance look like? You follow through with all assignments in a timely manner You give 100% to all tasks and projects you are given You will take full ownership of your projects and follow through to completion What is my potential for career growth? This role will introduce you to marketing, specifically B2B tech, and help you develop skills in content strategy and multimedia, integrated execution. Upon successful completion of this internship, you may be offered a full time position. What is the team like? You will work with, and be mentored by, the Sr Product Marketing Manager. You will meet with them on a regular basis to discuss your performance. This team is data driven and results oriented. You will collaborate regularly with members of your team to implement actionable solutions. Ideas and input are encouraged from all members. Sounds great! What’s the company culture? We are looking for individuals who are: Game Changers- A game changer is someone who looks at problems with an open mind and shares new ideas with team members, regularly reassesses existing plans and attaches a realistic timeline to goals, makes profitable, productive, and innovative contributions, and actively pursues improvements to Pattern’s processes and outcomes. Data Fanatics- A data fanatic is someone who recognizes problems and seeks to understand them through data, draws unbiased conclusions based on data that lead to actionable solutions, and continues to track the effects of the solutions using data. Partner Obsessed- An individual who is partner obsessed clearly explains the status of projects to partners and relies on constructive feedback, actively listens to partner’s expectations, and delivers results that exceed them, prioritizes the needs of your partners, and takes the time to create a personable experience for those interacting with Pattern. Team of Doers- Someone who is a part of a team of doers uplifts team members and recognizes their specific contributions, takes initiative to help in any circumstance, actively contributes to supporting improvements, and holds themselves accountable to the team as well as to partners. What is the hiring process? Initial phone interview with Pattern’s Talent Acquisition team Onsite interview with a panel of department leaders Executive review Offer How can I stand out as an applicant? Be prepared to talk about professional accomplishments with specific data to quantify examples Be ready to talk about how you can add value and be the best addition to the team Focus on mentioning how you would be partner obsessed at Pattern Be prepared to talk about any side projects related to data and analytics Why should I intern at Pattern? Pattern offers big opportunities to make a difference in the ecommerce industry! We are a company full of talented people that evolves quickly and often. We set big goals, work tirelessly to achieve them, and we love our Pattern community. We also believe in having fun and balancing our lives, so we offer awesome benefits that include Onsite Fitness Center Casual Dress Code Competitive Pay Pattern provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability, status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws. Pattern is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. Ecommerce is booming. The challenges we solve are exciting. And we’re just getting started. We’re looking for talented people with plenty of hustle to change the game at Pattern. Is that you? Let's chat",
                "title": "Internship - Product Marketing",
                "title_link": "https:\/\/pattern.wd1.myworkdayjobs.com\/en-US\/Pattern_Careers\/job\/Lehi-UT\/Internship---Product-Marketing_R-100508?source=Linkedin",
                "service_name": "pattern.wd1.myworkdayjobs.com"
            }
        ],
        "thread_ts": "1698281775.000549",
        "reply_count": 2,
        "reply_users_count": 2,
        "latest_reply": "1698291229.090819",
        "reply_users": [
            "U05AQGJMMT6",
            "U03LXQE14NM"
        ],
        "replies": [
            {
                "user": "U05AQGJMMT6",
                "ts": "1698284568.985049"
            },
            {
                "user": "U03LXQE14NM",
                "ts": "1698291229.090819"
            }
        ],
        "is_locked": false,
        "subscribed": false
    },
    {
        "client_msg_id": "8a8d0a95-e4b6-43a6-ada1-3aea89afb5fa",
        "type": "message",
        "text": "Product marketing internship in a Utah :arrow_up:",
        "user": "U03LXQE14NM",
        "ts": "1698281822.401259",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "Q0pYp",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Product marketing internship in a Utah "
                            },
                            {
                                "type": "emoji",
                                "name": "arrow_up",
                                "unicode": "2b06-fe0f"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "cc176dbcf62e",
            "image_72": "https:\/\/avatars.slack-edge.com\/2022-06-23\/3726381961473_cc176dbcf62ebe91e48a_72.jpg",
            "first_name": "Austin",
            "real_name": "Austin Schofield",
            "display_name": "Austin Schofield",
            "team": "T0ZBAEL59",
            "name": "schofieldda",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "client_msg_id": "231b4e69-4674-4dec-bd28-f78c0921015b",
        "type": "message",
        "text": "<@U03LXQE14NM> is there any recent update on Pattern recruiting? I spoke to them during the Marketing Fair on Tanner building and the guy told me they were not recruiting for MBA level.",
        "user": "U05AQGJMMT6",
        "ts": "1698284568.985049",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "hT+Ft",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "user",
                                "user_id": "U03LXQE14NM"
                            },
                            {
                                "type": "text",
                                "text": " is there any recent update on Pattern recruiting? I spoke to them during the Marketing Fair on Tanner building and the guy told me they were not recruiting for MBA level."
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "86b9fe7ca0ea",
            "image_72": "https:\/\/avatars.slack-edge.com\/2023-06-15\/5421183058375_86b9fe7ca0ea9a709a9d_72.jpg",
            "first_name": "Julio",
            "real_name": "Julio Cesar Augusto",
            "display_name": "",
            "team": "T0ZBAEL59",
            "name": "augusto.jcesar",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1698281775.000549",
        "parent_user_id": "U03LXQE14NM"
    },
    {
        "client_msg_id": "8E62E4DD-3822-47F5-9CCE-EE712F926A49",
        "type": "message",
        "text": "I don’t know—I just was this on LinkedIn.  The job description will usually say if it’s for mba or undergrad interns",
        "user": "U03LXQE14NM",
        "ts": "1698291229.090819",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "J6CGE",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "I "
                            },
                            {
                                "type": "text",
                                "text": "don’t"
                            },
                            {
                                "type": "text",
                                "text": " know"
                            },
                            {
                                "type": "text",
                                "text": "—"
                            },
                            {
                                "type": "text",
                                "text": "I just was this on LinkedIn.  The job description will usually say if "
                            },
                            {
                                "type": "text",
                                "text": "it’s"
                            },
                            {
                                "type": "text",
                                "text": " for mba or undergrad interns"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0ZBAEL59",
        "user_team": "T0ZBAEL59",
        "source_team": "T0ZBAEL59",
        "user_profile": {
            "avatar_hash": "cc176dbcf62e",
            "image_72": "https:\/\/avatars.slack-edge.com\/2022-06-23\/3726381961473_cc176dbcf62ebe91e48a_72.jpg",
            "first_name": "Austin",
            "real_name": "Austin Schofield",
            "display_name": "Austin Schofield",
            "team": "T0ZBAEL59",
            "name": "schofieldda",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1698281775.000549",
        "parent_user_id": "U03LXQE14NM"
    }
]